Repository: JoanaZalli/InternshipProject-Kevin
Catalog: Application/Resources/LocalizationResources.*.resx
Languages: it_it

# BlockedAccount
source: Account is blocked due to multiple incorrect tries.
it_it: L'account è bloccato a causa di più tentativi errati

# DuplicateEmail
source: Email already exists.
it_it: Email già esistente.

# DuplicateUsername
source: Username already exists.
it_it: Il nome utente esiste già.

# EmailAlreadyVerified
source: The email was already verified.
it_it: L'e-mail è già stata verificata.

# EmailDoesntExist
source: The provided email does not exist.
it_it: L'e-mail fornita non esiste.

# EmailFormatRestriction
source: Please follow the given email format "johndoe@mail.com
it_it: Si prega di seguire il formato e-mail indicato "johndoe@mail.com

# EmptyAccessToken
source: Please provide the access token.
it_it: Fornisci il token di accesso.

# EmptyEmail
source: The email can not be empty. Please provide a value.
it_it: L'e-mail non può essere vuota. Fornisci un valore.

# EmptyFirstName
source: The first name can not be empty. Please provide a value.
it_it: Il nome non può essere vuoto. Fornisci un valore.

# EmptyId
source: Please provide a id associated with the entity.
it_it: Fornisci un ID associato all'entità.

# EmptyLastName
source: The last name can not be empty. Please provide a value.
it_it: Il cognome non può essere vuoto. Fornisci un valore.

# EmptyPassword
source: The password can not be empty. Please provide a value.
it_it: La password non può essere vuota. Fornisci un valore.

# EmptyPermissionName
source: The name of the permission can not be empty. Please provide a value.
it_it: Il nome dell'autorizzazione non può essere vuoto. Fornisci un valore.

# EmptyPhoneNumber
source: The phone number can not be empty. Please provide a value.
it_it: Il numero di telefono non può essere vuoto. Fornisci un valore.

# EmptyPrefix
source: The prefix can not be empty. Please provide a value.
it_it: Il prefisso non può essere vuoto. Fornisci un valore.

# EmptyRefreshToken
source: Please provide the refresh token.
it_it: Fornisci il token di aggiornamento.

# EmptyRoleName
source: The name of the role can not be empty. Please provide a value.
it_it: Il nome del ruolo non può essere vuoto. Fornisci un valore.

# EmptyToken
source: The token can not be empty. Please provide a value.
it_it: Il token non può essere vuoto. Fornisci un valore.

# EmptyUsername
source: The username can not be empty. Please provide a value.
it_it: Il nome utente non può essere vuoto. Fornisci un valore.

# EmptyVerificationTokens
source: Invalid request.
it_it: Richiesta non valida.

# FirstNameMaximumLengthRestriction
source: Your first name length must not exceed 25 characters.
it_it: La lunghezza del tuo nome non deve superare i 25 caratteri.

# IncorrectPassword
source: The entered password is not correct.
it_it: La password inserita non è corretta.

# InvalidPermissions
source: The provided permission/permissions are incorrect.
it_it: L'autorizzazione/le autorizzazioni fornite non sono corrette.

# InvalidRoles
source: The provided role/roles are incorrect.
it_it: Il ruolo/i ruoli forniti non sono corretti.

# InvalidToken
source: Provided token is incorrect.
it_it: Il token fornito non è corretto.

# InvalidUsername
source: Incorrect username entered.
it_it: Nome utente errato inserito.

# LastNameMaximumLengthRestriction
source: Your last name length must not exceed 25 characters.
it_it: La lunghezza del tuo cognome non deve superare i 25 caratteri.

# MissingPermission
source: You do not have the required permissions in order to access this resource.
it_it: Lei non dispone delle autorizzazioni necessarie per accedere a questa risorsa.

# PasswordLowercaseLetterRestriction
source: Your password must contain at least one lowercase letter.
it_it: La tua password deve contenere almeno una lettera minuscola.

# PasswordMaximumLengthRestriction
source: Your password length must not exceed 16 characters.
it_it: La lunghezza della tua password non deve superare i 16 caratteri.

# PasswordMinimumLengthRestriction
source: Your password length must be at least 8 characters.
it_it: La lunghezza della tua password deve essere di almeno 8 caratteri.

# PasswordNumberRestriction
source: Your password must contain at least one number.
it_it: La tua password deve contenere almeno un numero.

# PasswordsDontMatch
source: Passwords do not match.
it_it: Le passwords non corrispondono.

# PasswordUppercaseLetterRestriction
source: Your password must contain at least one uppercase letter.
it_it: La tua password deve contenere almeno una lettera maiuscola.

# PermissionDescriptionRestriction
source: The description of the permission must not exceed 250 characters.
it_it: La descrizione dell'autorizzazione non deve superare i 250 caratteri.

# PermissionDoesntExist
source: The provided permission does not exist.
it_it: L'autorizzazione fornita non esiste.

# PhoneNumberMaximumLengthRestriction
source: Your phone number must not exceed 20 characters.
it_it: Il tuo numero di telefono non deve superare i 20 caratteri.

# PhoneNumberMinimumLengthRestriction
source: Your phone number must be at least 8 characters.
it_it: Il tuo numero di telefono deve contenere almeno 8 caratteri.

# PrefixFormatRestriction
source: Please follow the given prefix format "+XX/+XXX"
it_it: Si prega di seguire il formato del prefisso indicato "+XX/+XXX"

# RoleDoesntExist
source: The provided role does not exist.
it_it: Il ruolo fornito non esiste.

# TokenExpired
source: Link has expired.
it_it: Il link e scaduto.

# UnathorizedAccess
source: You do not have the necessary authorization in order to access this resource.
it_it: Lei non ha l'autorizzazione necessaria per accedere a questa risorsa.

# UnverifiedEmail
source: Please verify your email in order to proceed with the login.
it_it: Verifica la tua email per procedere con il login.

# UsernameDoesntExist
source: The provided username does not exist.
it_it: Il nome utente fornito non esiste.

# UsernameMinimumLengthRestriction
source: Your username length must be at least 8 characters.
it_it: La lunghezza del tuo nome utente deve essere di almeno 8 caratteri.

# UsernameNumberRestriction
source: Your username must contain at least one number.
it_it: Il tuo nome utente deve contenere almeno un numero.
